1. Create a table called employees with the following structure?


: emp_id (integer, should not be NULL and should be a primary key) Q

: emp_name (text, should not be NULL) Q

: age (integer, should have a check constraint to ensure the age is at least 18) Q

: email (text, should be unique for each employee) Q

: salary (decimal, with a default value of 30,000).

Write the SQL query to create the above table with all constraints.

create table employees

(emp_id int not null,

emp_name text not null,

age int check(age >=18),

email int unique ,

salary dec default(30000));

2. Explain the purpose of constraints and how they help maintain data integrity in a database.
Provide examples of common types of constraints.

Constraintsin a database are rules enforced on the data in tablesto maintain accuracy,

consistency, and integrity. They ensure that only valid and meaningful data is stored,

reducing the risk of data corruption or errors.

Purpose of Constraints

1. Data Integrity: Constraints ensure the accuracy and reliability of data.
o Example: A constraint can ensure a person's age is always a non-negative
number.

2. Consistency: They enforce uniformity in data entry and relationships between tables.

Example: Ensuring that a product ID entered in a sales table exists in the products table.

3. Error Prevention: They prevent invalid data from being entered into the database.

Example: Rejecting entries where a required field is missing.

4. Business Rules Enforcement: Constraints can enforce specific rulesrelevant to an organization.

 Example: A salary must be greater than a minimum wage.

Common Types of Constraints

1. Primary Key Constraint

 Purpose: Ensures each row in a table has a unique identifier.

 Example: A StudentID column in a Students table must have unique values and
cannot be NULL.

SQL Syntax:

CREATE TABLE Students(
StudentID INT PRIMARY KEY,
Name VARCHAR(50)
);

2. Foreign Key Constraint

Purpose: Maintainsreferential integrity by ensuring that a value in one table
corresponds to a value in another.

Example: A StudentID in a Enrollments table must exist in the Students table.
SQL Syntax:

CREATE TABLE Enrollments (

EnrollmentID INT PRIMARY KEY,

StudentID INT,

FOREIGN KEY (StudentID) REFERENCES Students(StudentID)

);

3. Unique Constraint

Purpose: Ensures that a column cannot have NULL values.

Example: A Name column in a Employees table must always have a value.

SQL Syntax:

CREATE TABLE Employees(

  EmployeeID INT PRIMARY KEY,

Name VARCHAR(50) NOT NULL

);

5. Check Constraint

 Purpose: Ensures that all values in a column satisfy a specific condition.

 Example: A Salary column in a Jobs table must be greater than 0.

 SQL Syntax:

CREATE TABLE Jobs(

JobID INT PRIMARY KEY,

Salary DECIMAL(10, 2),

CHECK (Salary > 0)

);

6. Default Constraint

Purpose: Assigns a default value to a column when no value is provided.

Example: A Status column in an Orders table defaults to 'Pending'.

SQL Syntax:

CREATE TABLE Orders(

OrderID INT PRIMARY KEY,

Status VARCHAR(20) DEFAULT 'Pending');

3.Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify your answer.
Why Apply the NOT NULL Constraint to a Column?

The NOT NULL constraint is applied to ensure that a column always contains a value and cannot be left empty. This is crucial when the presence of data in that column is essential for the database to function correctly or to maintain data integrity.

Reasons to Use NOT NULL:

1. Data Completeness: Ensures critical information is alwaysrecorded.

Example: A Name field in a Users table must not be NULL to identify users.

2. Avoid Errorsin Queries: Prevents issues when performing operations or calculations that assume a value is present.

Example: Calculating total = quantity * price would fail if price is NULL.

3. Consistency in Data Relationships: Supportsreferential integrity, particularly in foreign key relationships.

Example: A foreign key referencing a parent table cannot be NULL unless
explicitly designed for optional relationships.

Can a Primary Key Contain NULL Values?

No, a primary key cannot contain NULL values Justification:

1. Uniqueness Requirement: The primary key uniquely identifies each row in a table. A NULL value represents "unknown" or "missing" data, which cannot serve as a unique identifier.

If NULL were allowed, multiple rows could have NULL values, violating the
uniqueness rule.

2. Logical Integrity: The primary key is often used to reference rows in other tables via foreign keys. If a primary key contained NULL, the referenced rows would become ambiguous or invalid.

3. SQL Standard: According to SQL standards, the primary key constraint implicitly enforces both NOT NULL and UNIQUE constraints.

Example:

The following would result in an error:

CREATE TABLE Students (

StudentID INT PRIMARY KEY,

Name VARCHAR(50)

);

-- Attempt to insert a NULL value into the primary key column INSERT INTO Students(StudentID, Name) VALUES (NULL, 'John Doe'); -- Error: Primary key cannot be NULL

In conclusion:

â€¢ Apply the NOT NULL constraint to ensure essential data is always provided.

â€¢ A primary key cannot contain NULL values because it must uniquely and unambiguously identify each record in the table.

4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an example for both adding and removing a constraint.

Steps and SQL Commands for Adding or Removing Constraints on an Existing Table
Adding Constraints

1. Identify the Table and Column: Determine the table and column(s) where you want to add the constraint.

2. Use the ALTER TABLE Command: Use the ALTER TABLE statement with the appropriate syntax to add the constraint.

3. Specify the Constraint Type: Define the type of constraint (NOT NULL, UNIQUE, CHECK, etc.) and the rules it enforces.

Example: Adding a Constraint Suppose we have a table Employees without any constraints on the Email column.

CREATE TABLE Employees (

EmployeeID INT PRIMARY KEY,

Name VARCHAR(50),

Email VARCHAR(100));

To add a UNIQUE constraint on the Email column:

ALTER TABLE Employees

ADD CONSTRAINT UniqueEmail UNIQUE (Email);

To add a CHECK constraint to ensure EmployeeID is greater than 0:

ALTER TABLE Employees

ADD CONSTRAINT CheckEmployeeID CHECK (EmployeeID > 0);

Removing Constraints

1. Identify the Constraint Name: Determine the name of the constraint you want to remove. You can find constraint names by querying the database metadata (e.g.,INFORMATION_SCHEMA in SQL Server).

2. Use the ALTER TABLE Command: Use the ALTER TABLE statement with the DROP
CONSTRAINT clause.

Example: Removing a Constraint To remove the UNIQUE constraint on the Email column:

ALTER TABLE Employees

DROP CONSTRAINT UniqueEmail;

To remove the CHECK constraint on EmployeeID:

ALTER TABLE Employees

DROP CONSTRAINT CheckEmployeeID;

5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints. Provide an example of an error message that might occur when violating a constraint.

Consequences of Violating Constraints

When you attempt to insert, update, or delete data in a way that violates constraints in a database, the database management system (DBMS) enforces the rules defined by the constraints and prevents the operation. This ensures data integrity but results in an error.

Common Scenarios and Their Consequences

1. Violation of a NOT NULL Constraint

Attempt: Inserting or updating a row with a NULL value in a column defined as
NOT NULL.

Consequence: The operation fails because the column requires a value.

Example: If the Name column in an Employeestable has a NOT NULL constraint:

INSERT INTO Employees(EmployeeID, Name) VALUES (1, NULL);

Error Message (MySQL):

ERROR 1048 (23000): Column 'Name' cannot be null

2. Violation of a UNIQUE Constraint

Attempt: Inserting or updating a row with a duplicate value in a column defined
as UNIQUE.

Consequence: The operation fails because duplicate values are not allowed.

Example: If the Email column in an Users table has a UNIQUE constraint:

INSERT INTO Users (UserID, Email) VALUES (1, 'example@example.com');

INSERT INTO Users (UserID, Email) VALUES (2, 'example@example.com');

Error Message (PostgreSQL):

ERROR: duplicate key value violates unique constraint "users_email_key"

DETAIL: Key (email)=(example@example.com) already exists.

3. Violation of a PRIMARY KEY Constraint

 Attempt: Inserting or updating a row with a duplicate or NULL value in a primary key column.

 Consequence: The operation fails because a primary key must be unique and
cannot be NULL.

Example:

INSERT INTO Employees(EmployeeID, Name) VALUES (1, 'Alice');

INSERT INTO Employees (EmployeeID, Name) VALUES (1, 'Bob');

Error Message (SQL Server):

Msg 2627, Level 14, State 1, Line 1

Violation of PRIMARY KEY constraint 'PK_Employees'. Cannot insert duplicate key in object 'dbo.Employees'.

4. Violation of a FOREIGN KEY Constraint

Attempt: Inserting or updating a row with a value in a foreign key column that
does not exist in the referenced table, or deleting a referenced row in the parent table.

Consequence: The operation failsto preserve referential integrity.

Example:

INSERT INTO Orders(OrderID, CustomerID) VALUES (1, 999); -- Assuming 999 does notexist in the Customers table
Error Message (MySQL):

ERROR 1452 (23000): Cannot add or update a child row: a foreign key constraint fails

(`Orders`, CONSTRAINT `fk_customer` FOREIGN KEY (`CustomerID`) REFERENCES
`Customers` (`CustomerID`))

5. Violation of a CHECK Constraint

Attempt: Inserting or updating a row with a value that does not satisfy the
condition defined in a CHECK constraint.

Consequence: The operation fails because the value does not meet the defined
rule.

Example: If a Salary column has a CHECK constraint ensuring it must be greater
than 0:

INSERT INTO Jobs(JobID, Salary) VALUES (1, -500);

Error Message (Oracle):

ORA-02290: check constraint (SCHEMA.CHECK_SALARY) violated

6. You created a product stable without constraints asfollows:

CREATE TABLE products (

product_id INT,

product_name VARCHAR(50),

price DECIMAL(10, 2));

Now, you realise that?

: The product_id should be a primary key Q

: The price should have a default value of 50.00

ALTER TABLE products

ADD CONSTRAINT pk_product_id PRIMARY KEY (product_id);

ALTER TABLE products

ALTER COLUMN price SET DEFAULT 50.00;

7. You have two tables:

SELECT

students.student_name,

classes.class_name

FROM

students

INNER JOIN

classes

ON

students.class_id = classes.class_id;

8. Consider the following three tables:

SELECT

products.order_id,

customers.customer_name,

products.product_name

FROM

orders

LEFT JOIN

products

ON

orders.order_id = products.order_id

INNER JOIN

customers

ON

orders.customer_id = customers.customer_id;

10. You are given three tables:

SELECT

orders.customer_id,

customers.customer_name,

SUM(order_details.quantity)

FROM

orders

INNER JOIN

order_details ON orders.order_id = order_details.order_id

INNER JOIN

customers ON customers.customer_id = orders.customer_id

GROUP BY orders.customer_id , customers.customer_name;

                                                                 **SQL COMMANDS**

1-Identify the primary keys and foreign keys in maven movies db. Discuss the differences

The **Maven Movies** database is a popular sample relational database used for SQL practice. It simulates a movie rental company similar to Blockbuster and includes tables such as `customer`, `rental`, `inventory`, `film`, `payment`, etc.

---

## ðŸ”‘ Primary Keys and Foreign Keys

### âœ… Primary Keys

Primary keys uniquely identify each row in a table. Below are the primary keys of key tables in the **Maven Movies** database:

| Table              | Primary Key(s)                       |
| ------------------ | ------------------------------------ |
| **actor**          | `actor_id`                           |
| **address**        | `address_id`                         |
| **category**       | `category_id`                        |
| **city**           | `city_id`                            |
| **country**        | `country_id`                         |
| **customer**       | `customer_id`                        |
| **film**           | `film_id`                            |
| **inventory**      | `inventory_id`                       |
| **language**       | `language_id`                        |
| **payment**        | `payment_id`                         |
| **rental**         | `rental_id`                          |
| **staff**          | `staff_id`                           |
| **store**          | `store_id`                           |
| **film\_actor**    | composite (`actor_id`, `film_id`)    |
| **film\_category** | composite (`film_id`, `category_id`) |

---

### ðŸ”— Foreign Keys

Foreign keys create relationships between tables by referencing primary keys in other tables:

| Table              | Foreign Key(s)                                   | References                                                      |
| ------------------ | ------------------------------------------------ | --------------------------------------------------------------- |
| **address**        | `city_id`                                        | `city(city_id)`                                                 |
| **city**           | `country_id`                                     | `country(country_id)`                                           |
| **customer**       | `address_id`, `store_id`                         | `address(address_id)`, `store(store_id)`                        |
| **film**           | `language_id`, `original_language_id` (nullable) | `language(language_id)`                                         |
| **film\_actor**    | `actor_id`, `film_id`                            | `actor(actor_id)`, `film(film_id)`                              |
| **film\_category** | `film_id`, `category_id`                         | `film(film_id)`, `category(category_id)`                        |
| **inventory**      | `film_id`, `store_id`                            | `film(film_id)`, `store(store_id)`                              |
| **payment**        | `customer_id`, `staff_id`, `rental_id`           | `customer(customer_id)`, `staff(staff_id)`, `rental(rental_id)` |
| **rental**         | `inventory_id`, `customer_id`, `staff_id`        | `inventory(inventory_id)`, etc.                                 |
| **staff**          | `address_id`, `store_id`                         | `address(address_id)`, `store(store_id)`                        |
| **store**          | `address_id`, `staff_id` (manager)               | `address(address_id)`, `staff(staff_id)`                        |

---

## ðŸ†š Differences Between Primary Key and Foreign Key

| Feature         | Primary Key                                 | Foreign Key                                    |
| --------------- | ------------------------------------------- | ---------------------------------------------- |
| **Definition**  | Uniquely identifies a row in the same table | References a primary key in another table      |
| **Uniqueness**  | Must be unique                              | Can have duplicates                            |
| **Nullability** | Cannot be null                              | Can be null (in most cases)                    |
| **Purpose**     | Enforces entity integrity                   | Enforces referential integrity                 |
| **Used In**     | The table where the row is defined          | The table that needs to refer to another table |

---

2-List all details of actors

To **list all details of actors** in the **Maven Movies** database, you would query the `actor` table.

Hereâ€™s the SQL statement to do that:

```sql
SELECT * FROM actor;
```

---

### âœ… This query returns:

| Column Name   | Description                           |
| ------------- | ------------------------------------- |
| `actor_id`    | Unique ID for the actor (Primary Key) |
| `first_name`  | First name of the actor               |
| `last_name`   | Last name of the actor                |
| `last_update` | Timestamp of last update              |

---

### ðŸ“ Sample Output:

| actor\_id | first\_name | last\_name | last\_update        |
| --------- | ----------- | ---------- | ------------------- |
| 1         | PENELOPE    | GUINESS    | 2006-02-15 04:34:33 |
| 2         | NICK        | WAHLBERG   | 2006-02-15 04:34:33 |
| 3         | ED          | CHASE      | 2006-02-15 04:34:33 |
| ...       | ...         | ...        | ...                 |

3-List all customer information from DB.

To **list all customer information** from the **Maven Movies** database, you'll query the `customer` table.

---

### âœ… SQL Query:

```sql
SELECT * FROM customer;
```

---

### ðŸ“‹ Columns in `customer` Table:

| Column Name   | Description                                                    |
| ------------- | -------------------------------------------------------------- |
| `customer_id` | Unique ID for each customer (Primary Key)                      |
| `store_id`    | Store the customer is associated with (Foreign Key to `store`) |
| `first_name`  | Customer's first name                                          |
| `last_name`   | Customer's last name                                           |
| `email`       | Customer's email address                                       |
| `address_id`  | Customer's address ID (Foreign Key to `address`)               |
| `active`      | Indicates if the customer is currently active (1 = active)     |
| `create_date` | Date when the customer was created                             |
| `last_update` | Timestamp of last update                                       |

---

### ðŸ“ Example Output:

| customer\_id | store\_id | first\_name | last\_name | email                                                                             | address\_id | active | create\_date | last\_update        |
| ------------ | --------- | ----------- | ---------- | --------------------------------------------------------------------------------- | ----------- | ------ | ------------ | ------------------- |
| 1            | 1         | MARY        | SMITH      | [MARY.SMITH@sakilacustomer.org](mailto:MARY.SMITH@sakilacustomer.org)             | 5           | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| 2            | 1         | PATRICIA    | JOHNSON    | [PATRICIA.JOHNSON@sakilacustomer.org](mailto:PATRICIA.JOHNSON@sakilacustomer.org) | 6           | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| ...          | ...       | ...         | ...        | ...                                                                               | ...         | ...    | ...          | ...                 |

---

4-List different countries.

To **list different countries** in the Maven Movies database, you need to query the `country` table.

---

### âœ… SQL Query:

```sql
SELECT * FROM country;
```

Or if you only want the list of country names:

```sql
SELECT country FROM country;
```

Or to eliminate any duplicates (if they exist, though unlikely in this table):

```sql
SELECT DISTINCT country FROM country;
```

---

### ðŸ“‹ Columns in the `country` Table:

| Column Name   | Description                              |
| ------------- | ---------------------------------------- |
| `country_id`  | Unique ID for each country (Primary Key) |
| `country`     | Name of the country                      |
| `last_update` | Timestamp of last update                 |

---

### ðŸ“ Example Output:

| country\_id | country     | last\_update        |
| ----------- | ----------- | ------------------- |
| 1           | Afghanistan | 2006-02-15 04:34:33 |
| 2           | Algeria     | 2006-02-15 04:34:33 |
| 3           | Argentina   | 2006-02-15 04:34:33 |
| ...         | ...         | ...                 |

There are **109** countries in the standard Maven Movies (`Sakila`) database.

5-Display all active customers.

To **display all active customers** in the Maven Movies database, you need to query the `customer` table where the `active` column is set to `1`.

---

### âœ… SQL Query:

```sql
SELECT * FROM customer
WHERE active = 1;
```

---

### ðŸ” What This Query Does:

* Retrieves **only customers** who are marked as **active**
* The `active` column typically stores `1` for active and `0` for inactive customers

---

### ðŸ“ Sample Output:

| customer\_id | store\_id | first\_name | last\_name | email                                                                             | address\_id | active | create\_date | last\_update        |
| ------------ | --------- | ----------- | ---------- | --------------------------------------------------------------------------------- | ----------- | ------ | ------------ | ------------------- |
| 1            | 1         | MARY        | SMITH      | [MARY.SMITH@sakilacustomer.org](mailto:MARY.SMITH@sakilacustomer.org)             | 5           | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| 2            | 1         | PATRICIA    | JOHNSON    | [PATRICIA.JOHNSON@sakilacustomer.org](mailto:PATRICIA.JOHNSON@sakilacustomer.org) | 6           | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| ...          | ...       | ...         | ...        | ...                                                                               | ...         | 1      | ...          | ...                 |

---

6-List of all rental IDs for customer with ID 1.

To list all **rental IDs** for the **customer with ID = 1** in the Maven Movies database, youâ€™ll query the `rental` table using a `WHERE` clause.

---

### âœ… SQL Query:

```sql
SELECT rental_id
FROM rental
WHERE customer_id = 1;
```

---

### ðŸ“ What This Query Does:

* Filters the `rental` table for rows where `customer_id` is 1
* Returns only the `rental_id` column (you can add more columns if needed)

---

### ðŸ“ Sample Output:

| rental\_id |
| ---------- |
| 1          |
| 24         |
| 75         |
| ...        |

7-Display all the films whose rental duration is greater than 5.

To **display all films whose rental duration is greater than 5 days** in the Maven Movies database, you need to query the `film` table and filter using the `rental_duration` column.

---

### âœ… SQL Query:

```sql
SELECT *
FROM film
WHERE rental_duration > 5;
```

---

### ðŸ“‹ Relevant Columns in the `film` Table:

| Column Name       | Description                           |
| ----------------- | ------------------------------------- |
| `film_id`         | Unique ID for the film (Primary Key)  |
| `title`           | Title of the film                     |
| `description`     | Description of the film               |
| `rental_duration` | Number of days the film can be rented |
| `rental_rate`     | Cost to rent the film                 |
| ...               | Other metadata like length, rating    |

---

### ðŸ“ Sample Output:

| film\_id | title            | rental\_duration | ... |
| -------- | ---------------- | ---------------- | --- |
| 17       | ACADEMY DINOSAUR | 6                | ... |
| 42       | ADAPTATION HOLES | 7                | ... |
| ...      | ...              | ...              | ... |

---

8-List the total number of films whose replacement cost is greater than $15 and less than $20.

To **count the total number of films** in the Maven Movies database where the **replacement cost is greater than \$15 and less than \$20**, you will query the `film` table using a `WHERE` clause and use the `COUNT(*)` aggregate function.

---

### âœ… SQL Query:

```sql
SELECT COUNT(*) AS total_films
FROM film
WHERE replacement_cost > 15 AND replacement_cost < 20;
```

---

### ðŸ“ Explanation:

* `replacement_cost`: The cost to replace the film if it is lost or damaged.
* `COUNT(*)`: Counts all rows that meet the condition.
* `AS total_films`: Renames the result column for clarity.

---

### ðŸ§¾ Sample Output:

| total\_films |
| ------------ |
| 320          |

(Note: The number is illustrative; the actual count may vary depending on the dataset version.)

9-Display the count of unique first names of actors.

To **display the count of unique first names** of actors in the Maven Movies database, you will query the `actor` table and use the `COUNT(DISTINCT ...)` function.

---

### âœ… SQL Query:

```sql
SELECT COUNT(DISTINCT first_name) AS unique_first_names
FROM actor;
```

---

### ðŸ“ Explanation:

* `DISTINCT first_name`: Ensures each first name is counted only once.
* `COUNT(...)`: Counts the number of unique values.
* `AS unique_first_names`: Aliases the result column for readability.

---

### ðŸ§¾ Sample Output:

| unique\_first\_names |
| -------------------- |
| 128                  |

(*Note: The exact number may vary slightly depending on the dataset version.*)

10-Display the first 10 records from the customer table.

To **display the first 10 records** from the `customer` table in the Maven Movies database, you can use the `LIMIT` clause in SQL.

---

### âœ… SQL Query (MySQL/PostgreSQL/SQLite):

```sql
SELECT *
FROM customer
LIMIT 10;
```

---

### ðŸ“ Explanation:

* `SELECT *`: Selects all columns.
* `LIMIT 10`: Restricts the result to the first 10 rows in the table.

---

### ðŸ§¾ Sample Output:

| customer\_id | store\_id | first\_name | last\_name | email                                                                             | address\_id | active | create\_date | last\_update        |
| ------------ | --------- | ----------- | ---------- | --------------------------------------------------------------------------------- | ----------- | ------ | ------------ | ------------------- |
| 1            | 1         | MARY        | SMITH      | [MARY.SMITH@sakilacustomer.org](mailto:MARY.SMITH@sakilacustomer.org)             | 5           | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| 2            | 1         | PATRICIA    | JOHNSON    | [PATRICIA.JOHNSON@sakilacustomer.org](mailto:PATRICIA.JOHNSON@sakilacustomer.org) | 6           | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| ...          | ...       | ...         | ...        | ...                                                                               | ...         | ...    | ...          | ...                 |

11- Display the first 3 records from the customer table whose first name starts with 'b'.

To **display the first 3 records from the `customer` table where the first name starts with 'b'** (case-insensitive), you can use the `LIKE` operator with a wildcard and `LIMIT`.

---

### âœ… SQL Query:

```sql
SELECT *
FROM customer
WHERE first_name LIKE 'b%'
LIMIT 3;
```

---

### Explanation:

* `first_name LIKE 'b%'`: Matches first names starting with 'b'.
* `LIMIT 3`: Restricts the output to the first 3 records.
* Note: Depending on your DBMS, this is case-sensitive. For **case-insensitive** search in some systems, you might use:

  * **PostgreSQL:** `ILIKE 'b%'`
  * **MySQL (default collation):** `LIKE` is usually case-insensitive

---

### ðŸ“ Sample Output:

| customer\_id | store\_id | first\_name | last\_name | email                                                                         | address\_id | active | create\_date | last\_update        |
| ------------ | --------- | ----------- | ---------- | ----------------------------------------------------------------------------- | ----------- | ------ | ------------ | ------------------- |
| 25           | 1         | BRIAN       | SMITH      | [BRIAN.SMITH@sakilacustomer.org](mailto:BRIAN.SMITH@sakilacustomer.org)       | 10          | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| 47           | 2         | BRITTANY    | JONES      | [BRITTANY.JONES@sakilacustomer.org](mailto:BRITTANY.JONES@sakilacustomer.org) | 15          | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| 58           | 1         | BARRY       | WILLIAMS   | [BARRY.WILLIAMS@sakilacustomer.org](mailto:BARRY.WILLIAMS@sakilacustomer.org) | 18          | 1      | 2006-02-14   | 2021-06-15 04:34:33 |

12-Display the names of the first 5 movies which are rated as 'G'.

To **display the names (titles) of the first 5 movies rated 'G'**, query the `film` table with a filter on the `rating` column and limit the results.

---

### âœ… SQL Query:

```sql
SELECT title
FROM film
WHERE rating = 'G'
LIMIT 5;
```

---

### Explanation:

* `rating = 'G'`: Filters films rated 'G' (General Audience).
* `LIMIT 5`: Returns only the first 5 matching records.
* By default, the order might be arbitrary; you can add `ORDER BY` if you want a specific order (e.g., alphabetical).

---

### Optional: Alphabetically ordered results

```sql
SELECT title
FROM film
WHERE rating = 'G'
ORDER BY title
LIMIT 5;
```

---

### ðŸ“ Sample Output:

| title            |
| ---------------- |
| ACADEMY DINOSAUR |
| ACE GOLDFINGER   |
| ADAPTATION HOLES |
| AFFAIR PREJUDICE |
| AFRICAN EGG      |

---

13-Find all customers whose first name starts with "a".

To find all customers whose first name starts with **"a"**, you can use the `LIKE` operator with a wildcard `%` in the `customer` table.

---

### âœ… SQL Query:

```sql
SELECT *
FROM customer
WHERE first_name LIKE 'a%';
```

---

### Notes:

* This query returns customers with first names starting with lowercase **'a'**.
* Depending on your database's case sensitivity, if you want a **case-insensitive** search:

  * In **MySQL** (default collation): `LIKE` is case-insensitive.
  * In **PostgreSQL**, use `ILIKE` instead:

    ```sql
    WHERE first_name ILIKE 'a%'
    ```

---

### ðŸ“ Sample Output:

| customer\_id | store\_id | first\_name | last\_name | email                                                                       | address\_id | active | create\_date | last\_update        |
| ------------ | --------- | ----------- | ---------- | --------------------------------------------------------------------------- | ----------- | ------ | ------------ | ------------------- |
| 3            | 1         | AMY         | ALLEN      | [AMY.ALLEN@sakilacustomer.org](mailto:AMY.ALLEN@sakilacustomer.org)         | 7           | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| 8            | 2         | ALAN        | ANDERSON   | [ALAN.ANDERSON@sakilacustomer.org](mailto:ALAN.ANDERSON@sakilacustomer.org) | 11          | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| ...          | ...       | ...         | ...        | ...                                                                         | ...         | ...    | ...          | ...                 |

14- Find all customers whose first name ends with "a".

To find all customers whose **first name ends with "a"**, you can use the `LIKE` operator with the `%` wildcard before the letter `a`.

---

### âœ… SQL Query:

```sql
SELECT *
FROM customer
WHERE first_name LIKE '%a';
```

---

### Notes:

* `%a` means any sequence of characters ending with `a`.
* Case sensitivity depends on the database:

  * In **MySQL** (default), `LIKE` is case-insensitive.
  * In **PostgreSQL**, for case-insensitive, use `ILIKE`:

    ```sql
    WHERE first_name ILIKE '%a'
    ```

---

### ðŸ“ Sample Output:

| customer\_id | store\_id | first\_name | last\_name | email                                                                         | address\_id | active | create\_date | last\_update        |
| ------------ | --------- | ----------- | ---------- | ----------------------------------------------------------------------------- | ----------- | ------ | ------------ | ------------------- |
| 15           | 1         | MARIA       | GARCIA     | [MARIA.GARCIA@sakilacustomer.org](mailto:MARIA.GARCIA@sakilacustomer.org)     | 12          | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| 28           | 2         | SONIA       | MARTINEZ   | [SONIA.MARTINEZ@sakilacustomer.org](mailto:SONIA.MARTINEZ@sakilacustomer.org) | 19          | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| ...          | ...       | ...         | ...        | ...                                                                           | ...         | ...    | ...          | ...                 |

15- Display the list of first 4 cities which start and end with 'a'.

To display the **first 4 cities** whose names **start and end with 'a'**, you can query the `city` table using the `LIKE` operator with wildcards and limit the results.

---

### âœ… SQL Query:

```sql
SELECT city
FROM city
WHERE city LIKE 'a%' AND city LIKE '%a'
LIMIT 4;
```

---

### Explanation:

* `city LIKE 'a%'`: City name starts with 'a'.
* `city LIKE '%a'`: City name ends with 'a'.
* `LIMIT 4`: Return only the first 4 matching records.

---

### Optional: Case-insensitive search

If your database is case-sensitive and you want to ensure case-insensitive matching, use:

* **PostgreSQL:**

```sql
SELECT city
FROM city
WHERE city ILIKE 'a%' AND city ILIKE '%a'
LIMIT 4;
```

---

### ðŸ“ Sample Output:

| city     |
| -------- |
| Atlanta  |
| Asmara   |
| Ankara   |
| Adelaide |

16- Find all customers whose first name have "NI" in any position.

To find all customers whose first name contains **"NI"** anywhere (case-sensitive), you can use the `LIKE` operator with `%NI%`.

---

### âœ… SQL Query:

```sql
SELECT *
FROM customer
WHERE first_name LIKE '%NI%';
```

---

### Notes:

* `%NI%` matches any first name containing the substring `"NI"` anywhere.
* Case sensitivity depends on your database:

  * In **MySQL** (default collation), this is usually **case-insensitive**, so it will match "Nina", "Anita", "Bernie", etc.
  * In **PostgreSQL**, use `ILIKE` for case-insensitive search:

```sql
WHERE first_name ILIKE '%ni%'
```

---

### ðŸ“ Sample Output:

| customer\_id | store\_id | first\_name | last\_name | email                                                                       | address\_id | active | create\_date | last\_update        |
| ------------ | --------- | ----------- | ---------- | --------------------------------------------------------------------------- | ----------- | ------ | ------------ | ------------------- |
| 52           | 1         | NINA        | WILLIAMS   | [NINA.WILLIAMS@sakilacustomer.org](mailto:NINA.WILLIAMS@sakilacustomer.org) | 22          | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| 103          | 2         | ANITA       | BROWN      | [ANITA.BROWN@sakilacustomer.org](mailto:ANITA.BROWN@sakilacustomer.org)     | 31          | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| ...          | ...       | ...         | ...        | ...                                                                         | ...         | ...    | ...          | ...                 |

17-Find all customers whose first name have "r" in the second position.

To find all customers whose **first name has "r" as the second character**, you can use the `LIKE` operator with an underscore `_` wildcard for a single character, followed by `'r'`, then `%` for the rest.

---

### âœ… SQL Query:

```sql
SELECT *
FROM customer
WHERE first_name LIKE '_r%';
```

---

### Explanation:

* `_` matches exactly one character (the first character).
* `r` is the second character.
* `%` matches any sequence of characters after that.

---

### Notes on Case Sensitivity:

* In **MySQL**, `LIKE` is case-insensitive by default, so this will match `Brian`, `Craig`, `Brenda`, etc.
* In **PostgreSQL**, use `ILIKE` for case-insensitive matching:

```sql
WHERE first_name ILIKE '_r%'
```

---

### ðŸ“ Sample Output:

| customer\_id | store\_id | first\_name | last\_name | email                                                                       | address\_id | active | create\_date | last\_update        |
| ------------ | --------- | ----------- | ---------- | --------------------------------------------------------------------------- | ----------- | ------ | ------------ | ------------------- |
| 45           | 1         | BRYAN       | SMITH      | [BRYAN.SMITH@sakilacustomer.org](mailto:BRYAN.SMITH@sakilacustomer.org)     | 21          | 1      | 2006-02-14   | 2021-06-15 04:34:33 |
| 68           | 2         | CRYSTAL     | JONES      | [CRYSTAL.JONES@sakilacustomer.org](mailto:CRYSTAL.JONES@sakilacustomer.org) | 27          | 1      | 2006-02-14   | 2021-06-15 04:34:33 |

---

18- Find all customers whose first name starts with "a" and are at least 5 characters in length.

19- Find all customers whose first name starts with "a" and ends with "o".

To find all customers whose first name starts with **"a"** and ends with **"o"**, you typically use a SQL query with the `LIKE` operator.

Here is the general SQL query assuming you have a table named `customers` and a column for the first name called `first_name`:

```sql
SELECT *
FROM customers
WHERE first_name LIKE 'a%o';
```

### Explanation:

* `'a%o'` means:

  * `a` at the start,
  * `%` any sequence of characters (including none),
  * `o` at the end.

---

20-Get the films with pg and pg-13 rating using IN operator.

To get films with ratings **PG** and **PG-13** using the `IN` operator, hereâ€™s the SQL query assuming your table is called `films` and the rating column is `rating`:

```sql
SELECT *
FROM films
WHERE rating IN ('PG', 'PG-13');
```

This query will select all films where the rating is either "PG" or "PG-13". Simple and efficient!

21-Get the films with length between 50 to 100 using between operator.

Hereâ€™s the SQL query to get films with length between 50 and 100 using the `BETWEEN` operator:

```sql
SELECT *
FROM films
WHERE length BETWEEN 50 AND 100;
```

This retrieves all films where the `length` is **from 50 up to 100**, inclusive.

22-Get the top 50 actors using limit operator.

To get the top 50 actors using the `LIMIT` operator, assuming your table is called `actors`, hereâ€™s a simple SQL query:

```sql
SELECT *
FROM actors
LIMIT 50;
```

This will return the first 50 rows from the `actors` table.

---

If you want the "top" 50 by some criteria (like alphabetical order by last name or highest rating), you should add an `ORDER BY` clause. For example, to get the first 50 actors ordered by last name:

```sql
SELECT *
FROM actors
ORDER BY last_name
LIMIT 50;
```

23-Get the distinct film ids from inventory table

To get the distinct film IDs from the `inventory` table, you can use the `DISTINCT` keyword like this:

```sql
SELECT DISTINCT film_id
FROM inventory;
```

This query returns all unique `film_id` values from the `inventory` table.

                                                                   *** Function ***

Basic Aggregate Functions:

Question 1:

Retrieve the total number of rentals made in the Sakila database.

Hint: Use the COUNT() function.

ANSWER:-

To retrieve the total number of rentals made in the Sakila database, you can use the `COUNT()` function on the `rental` table, which stores rental records.

Hereâ€™s the SQL query:

```sql
SELECT COUNT(*) AS total_rentals
FROM rental;
```

This will return the total count of rows (rentals) in the `rental` table.

Question 2:

Find the average rental duration (in days) of movies rented from the Sakila database.

Hint: Utilize the AVG() function.

String Functions:

ANSWER :-

To find the average rental duration (in days) of movies rented in the Sakila database, you can use the `AVG()` function on the `rental_duration` column from the `film` table. (Rental duration is typically stored in the `film` table.)

Hereâ€™s the SQL query:

```sql
SELECT AVG(rental_duration) AS average_rental_duration
FROM film;
```

This will give you the average rental duration in days.

---

If you want to calculate the average actual rental time based on `rental_date` and `return_date` from the `rental` table, you would do:

```sql
SELECT AVG(DATEDIFF(return_date, rental_date)) AS average_rental_time
FROM rental
WHERE return_date IS NOT NULL;
```

This calculates the average number of days between rental and return for all completed rentals.

Question 3:

Display the first name and last name of customers in uppercase.

Hint: Use the UPPER () function.

ANSWER :-

To display the first name and last name of customers in uppercase, you can use the `UPPER()` function on both columns.

Hereâ€™s the SQL query assuming the table is `customer` and the columns are `first_name` and `last_name`:

```sql
SELECT UPPER(first_name) AS first_name_upper,
       UPPER(last_name) AS last_name_upper
FROM customer;
```

Question 4:

Extract the month from the rental date and display it alongside the rental ID.

Hint: Employ the MONTH() function.

ANSWER :-

Hereâ€™s the SQL query to extract the month from the rental date and display it alongside the rental ID, assuming the table is `rental` and the columns are `rental_id` and `rental_date`:

```sql
SELECT rental_id,
       MONTH(rental_date) AS rental_month
FROM rental;
```

GROUP BY:

Question 5:

Retrieve the count of rentals for each customer (display customer ID and the count of rent

Hint: Use COUNT () in conjunction with GROUP BY.

ANSWER :-

To retrieve the count of rentals for each customer, showing the customer ID and the number of rentals, use this query:

```sql
SELECT customer_id,
       COUNT(*) AS rental_count
FROM rental
GROUP BY customer_id;
```

This groups the rentals by each `customer_id` and counts how many rentals each customer has made.

Question 6:

Find the total revenue generated by each store.

Hint: Combine SUM() and GROUP BY.

ANSWER :-      

To find the total revenue generated by each store, you can use the `SUM()` function on the `amount` column (usually in the `payment` table) and group the results by `store_id`.

Hereâ€™s the SQL query:

```sql
SELECT store_id,
       SUM(amount) AS total_revenue
FROM payment
GROUP BY store_id;
```

This will give you the total revenue collected by each store.

Question 7:

Determine the total number of rentals for each category of movies.

Hint: JOIN film_category, film, and rental tables, then use COUNT () and GROUP BY.

ANSWER :-      

To determine the total number of rentals for each movie category, you need to join these tables:

* `film_category` (links films to categories),
* `film` (to connect films),
* `inventory` (to link films to inventory items),
* `rental` (to get rental info),
* `category` (to get category names).

Hereâ€™s a complete SQL query to get the total rentals per category:

```sql
SELECT c.name AS category_name,
       COUNT(r.rental_id) AS total_rentals
FROM category c
JOIN film_category fc ON c.category_id = fc.category_id
JOIN film f ON fc.film_id = f.film_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY c.name
ORDER BY total_rentals DESC;
```

**Explanation:**

* Join `category` to `film_category` to get categories of each film.
* Join to `film` to connect films.
* Join to `inventory` to link films to inventory copies.
* Join to `rental` to count rentals per inventory item.
* Group by category name and count rentals.

Let me know if you want it tailored for a different schema!

Question 8:

Find the average rental rate of movies in each language.

Hint: JOIN film and language tables, then use AVG () and GROUP BY.

ANSWER :-      

To find the average rental rate of movies for each language, you need to join the `film` and `language` tables on `language_id` and then group by the language name.

Hereâ€™s the SQL query:

```sql
SELECT l.name AS language,
       AVG(f.rental_rate) AS average_rental_rate
FROM film f
JOIN language l ON f.language_id = l.language_id
GROUP BY l.name
ORDER BY average_rental_rate DESC;
```

This will show each language with the average rental rate of its movies.

Joins

Questions 9-

Display the title of the movie, customer s first name, and last name who rented it.

Hint: Use JOIN between the film, inventory, rental, and customer tables.

To display the **movie title** along with the **customer's first name and last name** who rented it, you need to join these tables:

* `film` (for the movie title),
* `inventory` (to link films to inventory items),
* `rental` (to get rental details),
* `customer` (to get customer names).

Hereâ€™s the SQL query:

```sql
SELECT f.title,
       c.first_name,
       c.last_name
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
JOIN customer c ON r.customer_id = c.customer_id;
```

This will give you the title of each movie along with the first and last name of the customer who rented it.

Question 10:

Retrieve the names of all actors who have appeared in the film "Gone with the Wind."

Hint: Use JOIN between the film actor, film, and actor tables.

To retrieve the names of all actors who have appeared in the film **"Gone with the Wind"**, you need to join these tables:

* `film` (to filter by film title),
* `film_actor` (to link films and actors),
* `actor` (to get actor names).

Hereâ€™s the SQL query:

```sql
SELECT a.first_name, a.last_name
FROM actor a
JOIN film_actor fa ON a.actor_id = fa.actor_id
JOIN film f ON fa.film_id = f.film_id
WHERE f.title = 'Gone with the Wind';
```

This will return the first and last names of all actors who acted in *Gone with the Wind*.

Question 11:

Retrieve the customer names along with the total amount they've spent on rentals.

Hint: JOIN customer, payment, and rental tables, then use SUM() and GROUP BY.

To retrieve customer names along with the total amount they've spent on rentals, you can join the `customer`, `payment`, and `rental` tables and then use `SUM()` on the payment amount grouped by customer.

Hereâ€™s the SQL query:

```sql
SELECT c.first_name,
       c.last_name,
       SUM(p.amount) AS total_spent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
JOIN rental r ON p.rental_id = r.rental_id
GROUP BY c.customer_id, c.first_name, c.last_name
ORDER BY total_spent DESC;
```

This will give you each customer's name and the total amount they have paid for rentals, ordered from highest spender to lowest.

Question 12:

List the titles of movies rented by each customer in a particular city (e.g., "London').

Hint: JOIN customer, address, city, rental, inventory, and film tables, then use GROUP BY.

Advanced Joins and GROUP BY:

To list the titles of movies rented by each customer in a particular city (e.g., **London**), you need to join these tables:

* `customer` (for customer info),
* `address` (to get city info),
* `city` (to filter by city name),
* `rental` (to get rental records),
* `inventory` (to link rentals to films),
* `film` (to get film titles).

Hereâ€™s the SQL query:

```sql
SELECT c.customer_id,
       c.first_name,
       c.last_name,
       GROUP_CONCAT(f.title SEPARATOR ', ') AS rented_movies
FROM customer c
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
WHERE ci.city = 'London'
GROUP BY c.customer_id, c.first_name, c.last_name
ORDER BY c.customer_id;
```

### Explanation:

* Joins connect customers to their addresses and cities.
* Filter for customers living in **London**.
* Join rental and inventory to get the films rented.
* `GROUP_CONCAT()` aggregates all rented movie titles per customer as a comma-separated list.
* Group by customer to list rented movies per customer.

                                                   ***Advanced Joins and Group By ***

Question 13:

Display the top 5 rented movies along with the number of times they've been rented.

Hint: JOIN film, inventory, and rental tables, then use COUNT () and GROUP BY, and limit the results.

To display the top 5 rented movies along with the number of times they've been rented, you can join `film`, `inventory`, and `rental`, then count rentals per movie, group by movie title, and limit the results to 5.

Hereâ€™s the SQL query:

```sql
SELECT f.title,
       COUNT(r.rental_id) AS rental_count
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.title
ORDER BY rental_count DESC
LIMIT 5;
```

This will show the 5 most rented movies and how many times each was rented.

Question 14:

Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).

Hint: Use JOINS with rental, inventory, and customer tables and consider COUNT() and GROUP BY.

To find customers who have rented movies from **both stores** (store ID 1 and 2), you need to:

1. Join the `rental`, `inventory`, and `customer` tables.
2. Determine from which store each rental came.
3. Group rentals by customer.
4. Use a `HAVING` clause to filter customers who rented from **both** stores.

### âœ… SQL Query:

```sql
SELECT r.customer_id,
       c.first_name,
       c.last_name,
       COUNT(DISTINCT i.store_id) AS store_count
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN customer c ON r.customer_id = c.customer_id
GROUP BY r.customer_id, c.first_name, c.last_name
HAVING COUNT(DISTINCT i.store_id) = 2;
```

### âœ… Explanation:

* `COUNT(DISTINCT i.store_id)` counts how many different stores each customer rented from.
* The `HAVING` clause ensures only those who rented from **both store 1 and store 2** (i.e., 2 unique store IDs) are returned.

                                                             *** Windows Function ***

1. Rank the customers based on the total amount they've spent on rentals.

To **rank customers based on the total amount** they've spent on rentals, you can use the `RANK()` window function along with `SUM()` and a `GROUP BY`.

### âœ… SQL Query (for MySQL 8.0+, PostgreSQL, SQL Server):

```sql
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_spent,
    RANK() OVER (ORDER BY SUM(p.amount) DESC) AS customer_rank
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name
ORDER BY customer_rank;
```

### âœ… Explanation:

* `SUM(p.amount)` calculates the total amount spent per customer.
* `RANK() OVER (ORDER BY SUM(p.amount) DESC)` ranks customers from highest to lowest spender.
* `GROUP BY` is used to aggregate payments per customer.

Let me know if you're using an older version of MySQL (pre-8.0) that doesn't support window functions â€” I can give you an alternative!

2. Calculate the cumulative revenue generated by each film over time.

To **calculate the cumulative revenue generated by each film over time**, you'll need to:

1. Join the relevant tables: `film`, `inventory`, `rental`, and `payment`.
2. Use a **window function** (`SUM() OVER (...)`) to compute cumulative revenue.
3. Partition by `film_id` and order by `payment_date` to track revenue growth over time.

---

### âœ… SQL Query (MySQL 8.0+ / PostgreSQL / SQL Server):

```sql
SELECT
    f.film_id,
    f.title,
    p.payment_date,
    p.amount,
    SUM(p.amount) OVER (
        PARTITION BY f.film_id
        ORDER BY p.payment_date
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ) AS cumulative_revenue
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
JOIN payment p ON r.rental_id = p.rental_id
ORDER BY f.film_id, p.payment_date;
```

---

### âœ… Explanation:

* `PARTITION BY f.film_id`: groups the data by each film.
* `ORDER BY p.payment_date`: orders the revenue accumulation over time.
* `SUM(...) OVER (...)`: calculates the running total (cumulative revenue).
* You get a row for each payment showing how much total revenue the film had earned up to that point.

Let me know if you want this grouped by month or need a version for an older SQL engine without window functions.

3. Determine the average rental duration for each film, considering films with similar lengths.

To **determine the average rental duration for each film**, considering **films with similar lengths**, you can:

1. Group films based on their `length` (e.g., into bins or ranges),
2. Calculate the average rental duration (from `rental_date` to `return_date`),
3. Group results by film and possibly by length range.

---

### âœ… Step-by-step SQL Query:

This version:

* Calculates **rental duration** in days per rental,
* Groups by `film` and its `length`,
* Shows average rental duration per film.

```sql
SELECT
    f.film_id,
    f.title,
    f.length,
    AVG(DATEDIFF(r.return_date, r.rental_date)) AS avg_rental_duration
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
WHERE r.return_date IS NOT NULL
GROUP BY f.film_id, f.title, f.length
ORDER BY f.length, avg_rental_duration DESC;
```

---

### âœ… Optional: Bucket Films by Length Range

If you want to **group similar-length films** (e.g., 0â€“60, 61â€“90, etc.) and compare average durations:

```sql
SELECT
    CASE
        WHEN f.length <= 60 THEN '0-60 mins'
        WHEN f.length <= 90 THEN '61-90 mins'
        WHEN f.length <= 120 THEN '91-120 mins'
        ELSE '121+ mins'
    END AS length_range,
    AVG(DATEDIFF(r.return_date, r.rental_date)) AS avg_rental_duration
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
WHERE r.return_date IS NOT NULL
GROUP BY length_range
ORDER BY length_range;
```

Let me know which version fits your goal betterâ€”or if you'd like both film-level and range-level views combined!

4. Identify the top 3 films in each category based on their rental counts.

To **identify the top 3 films in each category** based on **rental counts**, you can:

1. Join the following tables:

   * `category` (for category name),
   * `film_category` (to link films to categories),
   * `film`,
   * `inventory`,
   * `rental`.
2. Count the number of rentals per film.
3. Use the `RANK()` or `DENSE_RANK()` window function to rank films within each category.
4. Filter the result to get only the top 3 films per category.

---

### âœ… SQL Query (MySQL 8.0+ / PostgreSQL / SQL Server):

```sql
SELECT
    c.name AS category,
    f.title,
    COUNT(r.rental_id) AS rental_count,
    RANK() OVER (
        PARTITION BY c.name
        ORDER BY COUNT(r.rental_id) DESC
    ) AS rank_in_category
FROM category c
JOIN film_category fc ON c.category_id = fc.category_id
JOIN film f ON fc.film_id = f.film_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY c.name, f.title
HAVING rank_in_category <= 3
ORDER BY c.name, rank_in_category;
```

---

### âœ… Explanation:

* `RANK() OVER (PARTITION BY c.name ORDER BY COUNT(...) DESC)` ranks each film within its category based on rental count.
* `HAVING rank_in_category <= 3` ensures you only get the top 3 per category.
* `GROUP BY c.name, f.title` is needed to count rentals per film per category.

Let me know if you'd like to use `DENSE_RANK()` instead (to allow ties without skipping ranks) or if you're using an older version of SQL that lacks window functionsâ€”I can provide an alternative!

5. Calculate the difference in rental counts between each customer's total rentals and the average rentals across all customers.

To **calculate the difference in rental counts** between each customer's total rentals and the **average number of rentals across all customers**, you'll:

1. Count total rentals per customer.
2. Calculate the average rental count across all customers.
3. Subtract the average from each customer's total.

---

### âœ… SQL Query (MySQL 8.0+ / PostgreSQL / SQL Server):

```sql
WITH customer_rentals AS (
    SELECT
        customer_id,
        COUNT(*) AS total_rentals
    FROM rental
    GROUP BY customer_id
),
avg_rentals AS (
    SELECT AVG(total_rentals) AS avg_rental_count
    FROM customer_rentals
)
SELECT
    cr.customer_id,
    cr.total_rentals,
    ar.avg_rental_count,
    cr.total_rentals - ar.avg_rental_count AS difference_from_avg
FROM customer_rentals cr
CROSS JOIN avg_rentals ar
ORDER BY difference_from_avg DESC;
```

---

### âœ… Explanation:

* `customer_rentals`: gets total rentals per customer.
* `avg_rentals`: computes the average across all customers.
* Final SELECT calculates the difference between each customer's rental count and the average.
* `CROSS JOIN` is used to apply the average value to all rows.

6. Find the monthly revenue trend for the entire rental store over time.

To find the **monthly revenue trend** for the entire rental store over time, you can:

1. Use the `payment` table (contains revenue per rental).
2. Extract **year** and **month** from the `payment_date`.
3. Use `SUM(amount)` to calculate monthly revenue.
4. Group by year and month for a proper time series.

---

### âœ… SQL Query (works for MySQL, PostgreSQL, SQL Server):

```sql
SELECT
    YEAR(payment_date) AS year,
    MONTH(payment_date) AS month,
    SUM(amount) AS monthly_revenue
FROM payment
GROUP BY YEAR(payment_date), MONTH(payment_date)
ORDER BY year, month;
```

---

### âœ… Output Example:

| year | month | monthly\_revenue |
| ---- | ----- | ---------------- |
| 2005 | 5     | 729.85           |
| 2005 | 6     | 1834.90          |
| ...  | ...   | ...              |

---

### ðŸ” Optional: Format as "YYYY-MM" (if supported):

```sql
SELECT
    DATE_FORMAT(payment_date, '%Y-%m') AS month,
    SUM(amount) AS monthly_revenue
FROM payment
GROUP BY month
ORDER BY month;
```

7. Identify the customers whose total spending on rentals falls within the top 20% of all customers.

To **identify customers whose total spending falls within the top 20%**, you need to:

1. Calculate total spending per customer.
2. Rank or percentile each customer based on total spending.
3. Filter those in the **top 20%**.

---

### âœ… SQL Query (using `PERCENT_RANK()` â€“ MySQL 8.0+, PostgreSQL, SQL Server):

```sql
WITH customer_spending AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_spent
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
),
ranked_customers AS (
    SELECT *,
           PERCENT_RANK() OVER (ORDER BY total_spent DESC) AS percentile
    FROM customer_spending
)
SELECT customer_id, first_name, last_name, total_spent
FROM ranked_customers
WHERE percentile <= 0.20
ORDER BY total_spent DESC;
```

---

### âœ… Explanation:

* `customer_spending`: gets total spending per customer.
* `PERCENT_RANK()` ranks customers by spending from highest to lowest.
* `percentile <= 0.20`: selects only the **top 20% of spenders** (since highest spenders have lowest percentile values when ordered descending).

8. Calculate the running total of rentals per category, ordered by rental count.

To **calculate the running total of rentals per category**, ordered by each category's **rental count**, follow these steps:

1. Join the necessary tables:

   * `category`
   * `film_category`
   * `film`
   * `inventory`
   * `rental`
2. Count the number of rentals per category.
3. Use `SUM(...) OVER (...)` to compute the **running total**.

---

### âœ… SQL Query (MySQL 8.0+, PostgreSQL, SQL Server):

```sql
WITH category_rentals AS (
    SELECT
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM category c
    JOIN film_category fc ON c.category_id = fc.category_id
    JOIN film f ON fc.film_id = f.film_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY c.name
)
SELECT
    category_name,
    rental_count,
    SUM(rental_count) OVER (ORDER BY rental_count DESC) AS running_total
FROM category_rentals
ORDER BY rental_count DESC;
```

---

### âœ… Output Example:

| category\_name | rental\_count | running\_total |
| -------------- | ------------- | -------------- |
| Action         | 1200          | 1200           |
| Comedy         | 1100          | 2300           |
| Drama          | 950           | 3250           |
| ...            | ...           | ...            |

---

This gives you a cumulative total of rentals per category in descending order of popularity.

9. Find the films that have been rented less than the average rental count for their respective categories.

To find **films that have been rented less than the average rental count** for their **respective categories**, you'll:

1. Count rentals per film.
2. Calculate average rental count per category.
3. Compare each film's rental count to its category's average.

---

### âœ… SQL Query (MySQL 8.0+, PostgreSQL, SQL Server):

```sql
WITH film_rentals AS (
    SELECT
        f.film_id,
        f.title,
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM film f
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY f.film_id, f.title, c.name
),
category_avg AS (
    SELECT
        category_name,
        AVG(rental_count) AS avg_rental_count
    FROM film_rentals
    GROUP BY category_name
)
SELECT
    fr.film_id,
    fr.title,
    fr.category_name,
    fr.rental_count,
    ca.avg_rental_count
FROM film_rentals fr
JOIN category_avg ca
  ON fr.category_name = ca.category_name
WHERE fr.rental_count < ca.avg_rental_count
ORDER BY fr.category_name, fr.rental_count;
```

---

### âœ… Explanation:

* `film_rentals`: gets rental count for each film.
* `category_avg`: computes average rental count per category.
* Final `SELECT` joins the two and filters for films **below the average**.

10. Identify the top 5 months with the highest revenue and display the revenue generated in each month

To identify the **top 5 months with the highest revenue** and display the revenue generated in each, you can:

1. Aggregate payments by month and year.
2. Order by revenue descending.
3. Limit the results to the top 5.

---

### âœ… SQL Query (MySQL, PostgreSQL, SQL Server):

```sql
SELECT
    DATE_FORMAT(payment_date, '%Y-%m') AS month,
    SUM(amount) AS total_revenue
FROM payment
GROUP BY month
ORDER BY total_revenue DESC
LIMIT 5;
```

---

### Explanation:

* `DATE_FORMAT(payment_date, '%Y-%m')` groups payments by month (format like "2025-05").
* `SUM(amount)` sums the revenue for each month.
* Results are ordered to show the months with the highest revenue first.
* `LIMIT 5` restricts output to the top 5 months.

---

If your SQL dialect doesnâ€™t support `DATE_FORMAT()`, you can use:

* **PostgreSQL:** `TO_CHAR(payment_date, 'YYYY-MM')`
* **SQL Server:** `FORMAT(payment_date, 'yyyy-MM')`

                                                       *** Noralization & CTE ***


1. First Normal Form (INF):

a. Identify a table in the Sakila database that violates INF. Explain how you would normalize it to achieve INF.

### 1. First Normal Form (1NF) Violation in Sakila (Mavenmovies) Database

**Definition Recap:**
First Normal Form (1NF) requires that:

* Each column contains only atomic (indivisible) values.
* Each record is unique.
* There are no repeating groups or arrays.

---

### ðŸ” Identified Table That Violates 1NF:

**`actor_award` table**

**Definition:**

```sql
CREATE TABLE actor_award (
  actor_award_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  actor_id SMALLINT,
  first_name VARCHAR(45) NOT NULL,
  last_name VARCHAR(45) NOT NULL,
  awards VARCHAR(45) NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY  (actor_award_id),
  KEY idx_actor_last_name (last_name)
);
```

**Example Data:**

```sql
(1,12,'KARL','BERRY','Emmy, Oscar, Tony ','2006-02-15 04:34:33')
```

---

### ðŸš« Why It Violates 1NF:

* The **`awards`** column contains **multiple values in a single field**, such as `'Emmy, Oscar, Tony'`.
* This breaks the rule of atomicity â€” each attribute must contain only **one value**.

---

### âœ… How to Normalize to 1NF:

Split the multi-valued `awards` field into a separate table that allows storing one award per row.

---

### ðŸ” Normalized Schema:

#### a. `actor_award` (simplified to reference only actor info)

```sql
CREATE TABLE actor_award (
  actor_award_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  actor_id SMALLINT,
  first_name VARCHAR(45) NOT NULL,
  last_name VARCHAR(45) NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (actor_award_id)
);
```

#### b. `award` (new table for atomic award data)

```sql
CREATE TABLE award (
  award_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  actor_award_id SMALLINT UNSIGNED NOT NULL,
  award_name VARCHAR(45) NOT NULL,
  PRIMARY KEY (award_id),
  FOREIGN KEY (actor_award_id) REFERENCES actor_award(actor_award_id)
);
```

---

### âœ… Benefits of Normalization:

* Adheres to **1NF** by ensuring atomic values.
* Allows querying individual awards easily.
* Reduces data redundancy and improves scalability.

Would you like help writing the data migration queries for this normalization?

2. Second Normal Form (2NF):

a. Choose a table in Sakila and describe how you would determine whether it is in 2NF. If it violates 2NF, explain the steps to normalize it

### ðŸ” Understanding Second Normal Form (2NF)

**Definition Recap:**
A table is in **Second Normal Form (2NF)** if:

1. It is already in **First Normal Form (1NF)**.
2. **Every non-prime attribute is fully functionally dependent** on the **entire primary key**, not just part of it.

This means **no partial dependency** is allowed if the table has a **composite primary key**.

---

### âœ… Example Table to Examine: `film_actor`

**Definition:**

```sql
CREATE TABLE film_actor (
  actor_id SMALLINT UNSIGNED NOT NULL,
  film_id SMALLINT UNSIGNED NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (actor_id, film_id)
);
```

* **Primary Key:** `(actor_id, film_id)`
* **Non-prime attribute:** `last_update`

---

### ðŸ§  Is It in 2NF?

Let's evaluate `last_update`:

* Does `last_update` depend **only on actor\_id** or **film\_id**?
  âŒ No â€” it depends on the **whole combination** of `(actor_id, film_id)`.
* Is there **any partial dependency**?
  âœ… No â€” all non-key attributes depend on the full key.

âœ… Therefore, **`film_actor` is already in 2NF**.

---

### ðŸš« Let's Find a Table That Violates 2NF: `actor_award`

**Definition (again):**

```sql
CREATE TABLE actor_award (
  actor_award_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  actor_id SMALLINT,
  first_name VARCHAR(45) NOT NULL,
  last_name VARCHAR(45) NOT NULL,
  awards VARCHAR(45) NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (actor_award_id)
);
```

Although it has a single-column primary key (`actor_award_id`), there's redundancy:

* `first_name` and `last_name` are **repeated** despite already being present in the `actor` table.
* These values are **dependent on `actor_id`**, not on the whole primary key (`actor_award_id`).

### ðŸ” Why This Is a 2NF Violation:

* `first_name` and `last_name` are **partially dependent** on `actor_id`, not on the full key (`actor_award_id`).
* This is **data duplication** and violates **2NF**.

---

### âœ… Steps to Normalize to 2NF:

#### a. **Keep `actor_award` minimal:**

```sql
CREATE TABLE actor_award (
  actor_award_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  actor_id SMALLINT UNSIGNED NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (actor_award_id),
  FOREIGN KEY (actor_id) REFERENCES actor(actor_id)
);
```

#### b. **Move actor name info to `actor` table** (already exists):

```sql
-- Already defined:
CREATE TABLE actor (
  actor_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  first_name VARCHAR(45) NOT NULL,
  last_name VARCHAR(45) NOT NULL,
  ...
);
```

#### c. **(Optional) Normalize `awards` to a new table (as per 1NF):**

```sql
CREATE TABLE award (
  award_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  actor_award_id SMALLINT UNSIGNED NOT NULL,
  award_name VARCHAR(45) NOT NULL,
  PRIMARY KEY (award_id),
  FOREIGN KEY (actor_award_id) REFERENCES actor_award(actor_award_id)
);
```

---

### âœ… Benefits of 2NF Normalization:

* Eliminates **partial dependencies**.
* Avoids **redundancy** (e.g., repeating names).
* Enhances **data consistency and integrity**.

3. Third Normal Form (3NF):

a. Identify a table in Sakila that violates 3NF. Describe the transitive dependencies present and outline the steps to normalize the table to 3NF.

### ðŸ” Understanding Third Normal Form (3NF)

**Definition Recap:**
A table is in **Third Normal Form (3NF)** if:

1. It is in **Second Normal Form (2NF)**.
2. **No transitive dependencies** exist â€” i.e., **non-prime attributes do not depend on other non-prime attributes**.

---

### âœ… Candidate Table: `customer_list` (a **view**, but can help us illustrate a 3NF violation if implemented as a table)

Letâ€™s look at the `customer_list` view:

```sql
CREATE VIEW customer_list AS
SELECT
    cu.customer_id AS ID,
    CONCAT(cu.first_name, ' ', cu.last_name) AS name,
    a.address AS address,
    a.postal_code AS `zip code`,
    a.phone AS phone,
    city.city AS city,
    country.country AS country,
    IF(cu.active, 'active', '') AS notes,
    cu.store_id AS SID
FROM customer cu
JOIN address a ON cu.address_id = a.address_id
JOIN city ON a.city_id = city.city_id
JOIN country ON city.country_id = country.country_id;
```

Letâ€™s assume this view is turned into a table for reporting purposes.

---

### ðŸš« Why This Violates 3NF

If implemented as a single table with columns like:

| customer\_id | name | address | city | country | ... |
| ------------ | ---- | ------- | ---- | ------- | --- |

We can observe **transitive dependencies**:

* `country` depends on `city`
* `city` depends on `address_id` (via address)
* Thus, `country` depends on `address_id` **through** `city` â‡’ **transitive dependency**

This breaks 3NF because:

* `country` is **not directly dependent** on the primary key (`customer_id`)
* Instead, it depends on another non-key attribute (`city`)

---

### âœ… How to Normalize to 3NF

Break the table into smaller, logically distinct tables:

#### 1. `customer` (already exists)

```sql
CREATE TABLE customer (
  customer_id SMALLINT UNSIGNED PRIMARY KEY,
  store_id TINYINT UNSIGNED NOT NULL,
  first_name VARCHAR(45),
  last_name VARCHAR(45),
  email VARCHAR(50),
  address_id SMALLINT UNSIGNED NOT NULL,
  ...
);
```

#### 2. `address` (already exists)

```sql
CREATE TABLE address (
  address_id SMALLINT UNSIGNED PRIMARY KEY,
  address VARCHAR(50),
  city_id SMALLINT UNSIGNED NOT NULL,
  ...
);
```

#### 3. `city` (already exists)

```sql
CREATE TABLE city (
  city_id SMALLINT UNSIGNED PRIMARY KEY,
  city VARCHAR(50),
  country_id SMALLINT UNSIGNED NOT NULL,
  ...
);
```

#### 4. `country` (already exists)

```sql
CREATE TABLE country (
  country_id SMALLINT UNSIGNED PRIMARY KEY,
  country VARCHAR(50)
);
```

---

### ðŸ§  Key Dependencies (in Normalized Form):

* `customer_id` â†’ `address_id`
* `address_id` â†’ `city_id`
* `city_id` â†’ `country_id`
  â†’ All dependencies are now **direct** and well-defined in separate tables.

---

### âœ… Benefits of 3NF Normalization:

* Removes **transitive dependencies**
* Prevents **anomalies** during insert/update/delete
* Encourages **modularity and clarity** in database design

4. Normalization Process:

a. Take a specific table in Sakila and guide through the process of normalizing it from the initial unnormalized form up to at least 2NF.

### ðŸ” 4. Normalization Process in Sakila â€” From Unnormalized to 2NF

Letâ€™s walk through the normalization process using a **custom unnormalized version of the `customer` table** (a simplified, hypothetical version to show all key steps).

---

### ðŸ”§ **Step 1: Unnormalized Form (UNF)**

Suppose we have a table like this:

#### âŒ Unnormalized Table: `raw_customer_data`

| customer\_id | full\_name | address               | city     | country | phone    |
| ------------ | ---------- | --------------------- | -------- | ------- | -------- |
| 1            | John Smith | 123 Main St, Apt 4B   | New York | USA     | 555-1234 |
| 2            | Jane Doe   | 987 Elm St, Suite 101 | Toronto  | Canada  | 555-5678 |
| 3            | Mary Brown | 123 Main St, Apt 4B   | New York | USA     | 555-1234 |

#### ðŸš« Issues:

* `full_name` combines first and last name â€” **not atomic**
* `address` is a single string combining street, unit, etc.
* City and country are repeated â€” **data redundancy**
* No clear primary or foreign keys â€” violates normalization principles

---

### âœ… Step 2: First Normal Form (1NF)

**Goal:** Make all fields atomic and eliminate repeating groups.

#### âœ… 1NF Table: `customer_1nf`

| customer\_id | first\_name | last\_name | street\_address       | city     | country | phone    |
| ------------ | ----------- | ---------- | --------------------- | -------- | ------- | -------- |
| 1            | John        | Smith      | 123 Main St, Apt 4B   | New York | USA     | 555-1234 |
| 2            | Jane        | Doe        | 987 Elm St, Suite 101 | Toronto  | Canada  | 555-5678 |
| 3            | Mary        | Brown      | 123 Main St, Apt 4B   | New York | USA     | 555-1234 |

âœ… Now:

* Each field is **atomic**
* Repeating groups removed
* But we still have **data redundancy** in `city` and `country`

---

### âœ… Step 3: Second Normal Form (2NF)

**Goal:** Eliminate **partial dependencies** (where non-key attributes depend only on part of a composite key).

While this table doesnâ€™t have a composite key, we can still improve by removing **redundant hierarchical data** like city and country.

---

### âž¤ Create related tables:

#### a. `country`

```sql
| country_id | country   |
|------------|-----------|
| 1          | USA       |
| 2          | Canada    |
```

#### b. `city`

```sql
| city_id | city      | country_id |
|---------|-----------|------------|
| 1       | New York  | 1          |
| 2       | Toronto   | 2          |
```

#### c. `address`

```sql
| address_id | street_address         | city_id | phone     |
|------------|------------------------|---------|-----------|
| 1          | 123 Main St, Apt 4B    | 1       | 555-1234  |
| 2          | 987 Elm St, Suite 101  | 2       | 555-5678  |
```

#### d. `customer`

```sql
| customer_id | first_name | last_name | address_id |
|-------------|------------|-----------|------------|
| 1           | John       | Smith     | 1          |
| 2           | Jane       | Doe       | 2          |
| 3           | Mary       | Brown     | 1          |
```

---

### âœ… Final Notes:

* All tables now meet **2NF**:

  * No partial dependencies
  * Each non-key attribute depends **entirely** on the primary key of its table
* Redundancy (e.g., New York/USA) is **removed**
* Easier maintenance: update city/country **in one place**


5. CTE Basics:

a. Write a query using a CTE to retrieve the distinct list of actor names and the number of films they have acted in from the actor and film actor tables.

Certainly! Here's a query using a **Common Table Expression (CTE)** to retrieve a **distinct list of actor names** and the **number of films** they have acted in, using the `actor` and `film_actor` tables from the Sakila database:

---

### âœ… CTE Query:

```sql
WITH actor_film_count AS (
    SELECT
        a.actor_id,
        CONCAT(a.first_name, ' ', a.last_name) AS actor_name,
        COUNT(fa.film_id) AS film_count
    FROM actor a
    JOIN film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY a.actor_id, a.first_name, a.last_name
)
SELECT *
FROM actor_film_count
ORDER BY film_count DESC;
```

---

### ðŸ” Explanation:

* **CTE Name:** `actor_film_count`
* **Joins:** `actor` with `film_actor` on `actor_id`
* **Aggregation:** `COUNT(fa.film_id)` gives the number of films per actor
* **Final Select:** returns the full list ordered by the number of films (descending)

6. CTE with Joins:

a. Create a CTE that combines information from the film and language tables to display the film title, language name, and rental rate.

Certainly! Here's a SQL query using a **CTE with a JOIN** between the `film` and `language` tables to retrieve the **film title**, **language name**, and **rental rate**.

---

### âœ… CTE with JOIN Query:

```sql
WITH film_language_cte AS (
    SELECT
        f.film_id,
        f.title AS film_title,
        l.name AS language_name,
        f.rental_rate
    FROM film f
    JOIN language l ON f.language_id = l.language_id
)
SELECT *
FROM film_language_cte
ORDER BY film_title;
```

---

### ðŸ” Explanation:

* **CTE Name:** `film_language_cte`
* **Tables Involved:**

  * `film` provides `title` and `rental_rate`
  * `language` provides the `language name`
* **Join Condition:** `film.language_id = language.language_id`
* **Final Output:** Sorted by film title

7. CTE for Aggregation:

a. Write a query using a CTE to find the total revenue generated by each customer (sum of payments) from the customer and payment tables.

Certainly! Here's a SQL query using a **CTE (Common Table Expression)** to calculate the **total revenue generated by each customer** based on data from the `customer` and `payment` tables:

---

### âœ… CTE for Aggregation Query:

```sql
WITH customer_revenue AS (
    SELECT
        c.customer_id,
        CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
        SUM(p.amount) AS total_revenue
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
)
SELECT *
FROM customer_revenue
ORDER BY total_revenue DESC;
```

---

### ðŸ” Explanation:

* **CTE Name:** `customer_revenue`
* **Join:** `customer` joined with `payment` on `customer_id`
* **Aggregation:** `SUM(p.amount)` computes total revenue per customer
* **Grouping:** by customer ID and name
* **Final Output:** shows each customerâ€™s total revenue, ordered highest to lowest

8. CTE with Window Functions:

a. Utilize a CTE with a window function to rank films based on their rental duration from the film table

Certainly! Below is a SQL query using a **CTE with a window function** to **rank films by their rental duration**, using the `film` table from the Sakila database.

---

### âœ… CTE with Window Function Query:

```sql
WITH ranked_films AS (
    SELECT
        film_id,
        title,
        rental_duration,
        RANK() OVER (ORDER BY rental_duration DESC) AS rental_duration_rank
    FROM film
)
SELECT *
FROM ranked_films
ORDER BY rental_duration_rank, title;
```

---

### ðŸ” Explanation:

* **CTE Name:** `ranked_films`
* **Window Function Used:** `RANK() OVER (ORDER BY rental_duration DESC)`

  * Assigns the same rank to films with equal rental duration.
* **Columns Output:** film ID, title, rental duration, and rank
* **Ordering:** by rank (highest duration first), then alphabetically by title

9. CTE and Filtering:

a. Create a CTE to list customers who have made more than two rentals, and then join this CTE with the customer table to retrieve additional customer details.

Certainly! Here's a SQL query that uses a **CTE** to:

1. Identify customers who have made **more than two rentals**,
2. Then **join** that CTE with the `customer` table to retrieve additional details like their names and email.

---

### âœ… CTE with Filtering and Join:

```sql
WITH frequent_renters AS (
    SELECT
        customer_id,
        COUNT(*) AS rental_count
    FROM rental
    GROUP BY customer_id
    HAVING COUNT(*) > 2
)

SELECT
    c.customer_id,
    CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
    c.email,
    fr.rental_count
FROM frequent_renters fr
JOIN customer c ON fr.customer_id = c.customer_id
ORDER BY fr.rental_count DESC;
```

---

### ðŸ” Explanation:

* **CTE (`frequent_renters`)**:

  * Groups rentals by `customer_id` and filters to those with more than 2.
* **Main query**:

  * Joins the CTE with the `customer` table to get names and emails.
  * Displays customers sorted by how often they rent.

10. CTE for Date Calculations:

a. Write a query using a CTE to find the total number of rentals made each month, considering the rental date from the rental table

Certainly! Here's a SQL query using a **CTE (Common Table Expression)** to calculate the **total number of rentals made each month** from the `rental` table, using the `rental_date` column.

---

### âœ… CTE for Monthly Rental Count:

```sql
WITH monthly_rentals AS (
    SELECT
        DATE_FORMAT(rental_date, '%Y-%m') AS rental_month,
        COUNT(*) AS total_rentals
    FROM rental
    GROUP BY DATE_FORMAT(rental_date, '%Y-%m')
)

SELECT *
FROM monthly_rentals
ORDER BY rental_month;
```

---

### ðŸ” Explanation:

* **CTE Name:** `monthly_rentals`
* **`DATE_FORMAT(rental_date, '%Y-%m')`** extracts the year and month (e.g., `'2024-05'`)
* **`COUNT(*)`** counts all rentals in each month
* **Ordering** ensures months are shown in chronological order

11. CTE and Self-Join:

a. Create a CTE to generate a report showing pairs of actors who have appeared in the same film together, using the film_actor table.

Certainly! Here's a SQL query using a **CTE and a self-join** on the `film_actor` table to find **pairs of actors who have appeared in the same film together**.

---

### âœ… CTE with Self-Join to Find Actor Pairs:

```sql
WITH actor_pairs AS (
    SELECT
        fa1.film_id,
        fa1.actor_id AS actor1_id,
        fa2.actor_id AS actor2_id
    FROM film_actor fa1
    JOIN film_actor fa2
        ON fa1.film_id = fa2.film_id
       AND fa1.actor_id < fa2.actor_id  -- avoid duplicates and self-pairs
)

SELECT
    ap.film_id,
    CONCAT(a1.first_name, ' ', a1.last_name) AS actor_1,
    CONCAT(a2.first_name, ' ', a2.last_name) AS actor_2
FROM actor_pairs ap
JOIN actor a1 ON ap.actor1_id = a1.actor_id
JOIN actor a2 ON ap.actor2_id = a2.actor_id
ORDER BY ap.film_id, actor_1, actor_2;
```

---

### ðŸ” Explanation:

* **CTE Name:** `actor_pairs`

  * Self-joins `film_actor` to pair up actors in the same `film_id`
  * `fa1.actor_id < fa2.actor_id` avoids duplicate pairs (e.g., both `(A,B)` and `(B,A)`)
* **Final SELECT:**

  * Joins with `actor` table to get full actor names
  * Lists each actor pair along with the film they co-starred in

12. CTE for Recursive Search:

a. Implement a recursive CTE to find all employees in the staff table who report to a specific manager, considering the reports_to column.

To find all employees in the `staff` table who report (directly or indirectly) to a specific manager using a recursive Common Table Expression (CTE), we need to assume there is a `reports_to` column in the `staff` table. However, based on your provided schema, **the `staff` table does not contain a `reports_to` column**.

But, since the `store` table has a `manager_staff_id` which refers to the `staff_id`, we can simulate a reporting hierarchy if such a structure is assumed to exist.

For the purpose of this task, **letâ€™s assume** the `staff` table has the following additional column (even though it's not defined in your schema):

```sql
ALTER TABLE staff ADD COLUMN reports_to TINYINT UNSIGNED;
```

Now, here's how you can implement a recursive CTE to find all subordinates under a specific manager:

### âœ… Recursive CTE Query:

```sql
WITH RECURSIVE staff_hierarchy AS (
    -- Anchor member: start with the specified manager
    SELECT staff_id, first_name, last_name, reports_to
    FROM staff
    WHERE staff_id = @manager_id

    UNION ALL

    -- Recursive member: find staff reporting to those already found
    SELECT s.staff_id, s.first_name, s.last_name, s.reports_to
    FROM staff s
    INNER JOIN staff_hierarchy sh ON s.reports_to = sh.staff_id
)
SELECT * FROM staff_hierarchy
WHERE staff_id != @manager_id;  -- exclude the root manager if desired
```

### â„¹ï¸ How to Use:

Set your desired manager ID before running the query:

```sql
SET @manager_id = 1;  -- Replace with the actual manager's staff_id
```